app/controllers/cats_controller.rb

    def create
      @cat=Cat.create(cat_params)
      if @cat.save
---
INSERT INTO "cats" ("name", "created_at", "updated_at", "color") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "new try"], ["created_at", "2020-05-24 19:17:05.694565"], ["updated_at", "2020-05-24 19:17:05.694565"], ["color", "sddadas"]]
INSERT INTO "cats" ("name", "created_at", "updated_at", "color") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "tırnak"], ["created_at", "2020-05-24 21:21:43.887333"], ["updated_at", "2020-05-24 21:21:43.887333"], ["color", "sarı"]]

    def destroy
      @cat = Cat.find(params[:id])
      @cat.destroy
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]