app/views/cats/show.html.erb

SELECT "toys".* FROM "toys" WHERE "toys"."cat_id" = $1  [["cat_id", 1]]
---
    </div>
    <%@cat.toys.each do |toy|%>